import re
# Напишите функцию для парсинга номерных знаков автомоблей Украины (стандарты - AA1234BB, 12 123-45AB, a12345BC)
# с помощью регулярных выражений. Функция принимает строку и возвращает None если строка не является номерным знаком.
# Если вся сторка является номерным знаком - функция возвращает саму строку.


def foo(my_str):
    tpl = '[0-9]{2}\s[0-9]{3}-?[0-9]{2}[A-Z]{2}|' \
          '[a-z][1-9]{5}[A-Z]{2}|' \
          '[A-Z]{2}[0-9]{4}[A-Z]{2}'
    res = re.findall(tpl, my_str)
    return res[0]

print(foo('12 123-45AB'))

print('123'*13)